# # Задание 3
# # Написать в словесной форме и нарисовать блок-схему
# # алгоритма написания романа.

# загрузить ноутбук
# загрузить сознание
# загрузить мир_романа

# книга = сознание.мир_романа.ноутбук

# сознание.опустошение
# сознание.мир_романа
# ноутбук.положить_руки_на_клавиатуру.печатать_мысли

# сознание.включить.ноутубк.читать_экран

# если видишь текст:
#     стуктуруриуй
# текста нет
#     строка 13

# ноутбук.напиши_план_истории
# сознание.опустошение
# сознание.мир_одной_главы
# ноутбук_положить_руки_на_клавиатуру.печатать_мысли

# повторить