# [] Создать список числео от 1 до 10 вручную
# [] Числа не должны идти подряд и их должно быть штук 7
# [] Числа могут повторяться

# [] Написать программу, которая проверяет, Есть ли число в списке
# [] Написать функцию, которая возвращает номер позиции, если число найдено и None, если не найдено

# while
# +=
# -=
# [] - обращение по номеру позиции в списке

input = int(input("Введите число: "))
list = [7, 2, 4, 8, 3, 1, 5]

i=1
while True:
    i <= len(list)
    i+=1
    list[i] != input
    print(list[i-2])

# print(len(list))