/**
 * Отработка арифметических операторов
 * Создайте переменную и задайте ей любое числовое значение
 * ИСПОЛЬЗУЕМ АРИФМЕТКУ, НЕ СЧИТАЕМ РУКАМИ!!!
 * Увеличьте значение в 2 раза
 * Вычтите 10
 * Возьмите остаток от деления на 8
 * Возведите в третью степень
 * Увеличьте на 1 инкрементом
 * Выведите результат
 */

am=1;
am = am + 1;
number = 17;
mult = 50;
mult *= 2;
mn = mult - 100;
ost = 71 % 5;

base = 2;
expo = 3;
result = Math.pow(base,expo);

a = 5;
a++;

console.log('Сложение am = am + 1 ',am);
console.log('Присваивание числа ',number);
console.log('Умножение mult *= 2 ',mult);
console.log('Вычитание 100 из mult ',mn);
console.log('Остаток 71 % 5',ost);
console.log('Экспонента базы 2 к експоненте 3',result);
console.log('a инкрементом',a);