# Задание №1 (Список еды)
# Создать список еды, самой любимой, не меньше 5 блюд.
# Вывести на экран:
# Моя любимая еда:
# Картошка
# Гречка
# ...
# Хлеб


food_list = ['Грибовница', 'Борщ', 'Жарёха', 'Шурпа', 'Салат с помидорами']

for i in food_list:
    print(i)