/**
 * Задания для самостоятельной работы
1. Выведите в консоли строку «Я читаю первую главу»
2. Используя переменные, изменяйте в выводимой в консоли строке «Я
читаю первую главу» номер главы на «вторую», «третью», «пятую».
Выведите все 4 строки.
3. Создайтетекстпрограммы,выводящейнаэкранкоддлявыводастроки«Я
изучаю JavaScript» с комментариями к каждой строке.
4. Создайтетекстпрограммы,выводящейвстолбиксписокднейнедели.
Сохраните файл под именем «Week.js» и запустите его при помощи браузера. Какой ещё файл вам потребовалось создать?
 Академия ТОП, Баринова Вера Олеговна, 2024
11
5. Сравните2любыхредакторакодаиопишите5любыхинструментов, имеющихся в обоих редакторах, с точки зрения удобства пользования.
6. Напишитеподробнуюпошаговуюинструкциюдлянаписанияизапускаиз браузера программы, выводящей в консоль строку «Здравствуй, мир!», начиная с включения компьютера и заканчивая сохранением наработок и выключением. Можете изобразить результат с помощью блок-схемы

 */
console.log('Задание 1:')
console.log('Я читаю первую главу'); // Тут вроде просто

console.log('Задание 2:')
first = 'первую';
second = 'вторую';
third = 'третью';
fifth = 'пятую';
console.log('Я читаю ' +first+ ' главу');
console.log('Я читаю ' +second+ ' главу');
console.log('Я читаю ' +third+ ' главу');
console.log('Я читаю ' +fifth+ ' главу'); // Тоже самое, но строка делится по середине, где вставляется переменная

console.log('Задание 3:')
console.log('Комментрии к каждой строке программы: "Я изучаю JavaScript" - будет один');
console.log('Я изучаю JavaScript');
console.log('А вот с комментариями:');
console.log('console.log("Я изучаю JavaScript"); // А я говорил!');

