# # 1. Напечатать число 5 и строку 5
# # 2. Создать переменную со значением 8 строка и со значением 16 число, вывести их на печать через пробел

# number = 5
# string = "5"

# variable = "8"
# varable_integer = 16

# print(number, string, variable, varable_integer)

# 3. Вывести на печать, сохранив возраст и имя в переменную:
# Я - Вера, мне 39 лет (только со своими данными)
# 4. Сохранить единую строку с теми же данными
name = 'Слава'
age = 39
print(f'Я {str(name)}, мне {str(age)} лет')
print('Я ' + str(name) + ' мне ' + str(age) + ' лет')