# Вывести на экран таблицу из 4 строк: три товара и сумма без использования цикла

#table elements
el01 = '--------------'
el02 = '+'
el03 ='|'
dt01 = 'Горох'
dt02 = '10кг'
hor = 'iwiwi'
d = {dt01, dt02}

print('\n'.join([el02+el01+el02+el01+el02]))
print('|    Горох     |     10кг     |')
print('\n'.join([el02+el01+el02+el01+el02]))
print('|    Ананас    |     19кг     |')
print('\n'.join([el02+el01+el02+el01+el02]))
print('|    Бананы    |     28кг     |')
print('\n'.join([el02+el01+el02+el01+el02]))