# [>] С помощью только while сделать задачи 2, 3, 4

# [+] Спросить человека размеры поля (х * у), получить их ОДНИМ вводом '7x8', "нарисовать" поле буковками о без использования цикла.
# [+] Нарисовать только границу поля и пустую серединку.
# [] Вывести на экран таблицу из 4 строк: три товара и сумма без использования цикла

# el1 = '|'

# items = {
#     'item1' : ('Пельмени', 600),
#     'item2' : ('Суши', 3000),
#     'item3' : ('Порш', 3200000)
# }

# item_list = list(items.values())
# # item_list = list(items.keys())
# print(item_list)

