/*
Экзаменационное задание на 8 баллов:
2 балла: создать файлы myexam.html и work.js, открыть страницу в браузере, на экране должен отобразиться текст "Экзамен", а в консоли "начинается" .
3 (Третий балл): В файле js присутствует написанная вами функция с именем tam без синтаксических ошибок. Мне все равно, что она делает.
4 (Четвертый балл): В файле html присутствует кнопка, к ней привязана функция. Поскольку динамическую привязку событий мы пока не проходили, если я увижу addEventListener и студент не сможет на пустом файле без интернета при мне сидя рядом выполнить дополнительное задание на события, буду считать, что экзамен провален).
5 (Пятый балл): На странице должно быть числовое поле ввода, а в функции tam - получение доступа к этому полю. Самым простым современный способом, без использования document.get... и document.query
6 (Шестой балл): На странице должно быть числовое поле ввода (мне без разницы, вы его создадите средствами html или js) и кнопка. Если ввести в поле ввода 5, то нажатии на кнопку в консоли появится надпись "Там 5".
Шесть - проходной балл. Если вы его набрали, экзамен сдан.
*/

/*
7 (Седьмой балл): ...Также при нажатии на кнопку на странице должен появиться список, а в нем - один элемент, который содержит надпись "Я тоже вижу значение 5", если в поле ввода 5. А если не 5, то другое ))))
8 (Восьмой балл): Список должен содержать числа от вашего до нуля включительно, записанные в обратном порядке.

Экзаменационное задание на 9-12 баллов (бирюльки) выдается на дом при выполнении основного задания:
Написать страницу, на которой создается таблица 4*4 с числами от 1 до 8. Каждое число встречается в таблице дважды. Числа расположены случайным образом. Изначально клетки таблицы выглядят белыми.
Если нажать на клетку, число в ней становится видно (открыто). При "открытии" второй клетки, если числа совпадают, они остаются видны до конца игры. Если не совпадают, две последние "открытые" клеточки закрываются.
Игра должна поздравить игрока с победой, когда все клеточки открыты, и указать количество сделанных попыток.
*/