/*

[+] Когда страница открывается, на ней появляется надпись "Экзамен по Географии",
[] вопрос "Столица Англии?",
[+] поле ввода и кнопка.

[] При вводе "Лондон" и нажатии на кнопку, 
[] вопрос должен заменятся на новый
[] (придумайте заранее 3 вопроса, например про Париж (Франция) и Мадрид (Испания)),
[] а ответ и первый вопрос записываться в таблицу
[] с пометкой "верно" или "неверно".

[] После трех вопросов в таблице появляется последняя строка "Ваша оценка 5" - 3,4 или 5 в зависимости от количества верных ответов.

*/