# Задачи на типы данных:
# 1. Создать переменную для хранения вашего веса, записать туда вес
# 2. Создать переменную для хранения названия нашей улицы Кутузовский проспект, вывести её на печать
# 3. Создать переменную для хранения номера года, проверить, делится ли он на 4 (сравнение на равенство, как в js ==)
# 4. С помощью ветвления записать мысль: "Делится ли текущий год на 4? - високосный Иначе? невисокосный"
# Запустить программу
# 5. Создать переменную для хранения слов в словаре для перевода с русского на английский. Записать туда три слова с переводом:
# light - лёгкий
# idle - праздный
# environment - среда
# Вывести на печать перевод на английский слова лёгкий
# Добавить в словарь слово weight - вес
# Заменить "праздный" на "бездействующий"